{"config": [{"config": [{"config": {"W_constraint": null, "W_regularizer": null, "input_dim": null, "batch_input_shape": [null, 180], "output_dim": 512, "trainable": true, "bias": true, "input_dtype": "float32", "name": "dense_1", "activity_regularizer": null, "b_constraint": null, "b_regularizer": null, "init": "glorot_uniform", "activation": "relu"}, "class_name": "Dense"}, {"config": {"name": "dropout_1", "trainable": true, "p": 0.25}, "class_name": "Dropout"}, {"config": {"W_constraint": null, "W_regularizer": null, "input_dim": null, "bias": true, "output_dim": 256, "trainable": true, "name": "dense_2", "activity_regularizer": null, "b_constraint": null, "b_regularizer": null, "init": "glorot_uniform", "activation": "relu"}, "class_name": "Dense"}, {"config": {"name": "dropout_2", "trainable": true, "p": 0.1}, "class_name": "Dropout"}, {"config": {"W_constraint": null, "W_regularizer": null, "input_dim": null, "bias": true, "output_dim": 128, "trainable": true, "name": "dense_3", "activity_regularizer": null, "b_constraint": null, "b_regularizer": null, "init": "glorot_uniform", "activation": "relu"}, "class_name": "Dense"}, {"config": {"name": "dropout_3", "trainable": true, "p": 0.1}, "class_name": "Dropout"}, {"config": {"W_constraint": null, "W_regularizer": null, "input_dim": null, "bias": true, "output_dim": 5, "trainable": true, "name": "dense_4", "activity_regularizer": null, "b_constraint": null, "b_regularizer": null, "init": "glorot_uniform", "activation": "linear"}, "class_name": "Dense"}], "class_name": "Sequential"}, {"config": {"activation": "softmax", "name": "activation_1", "trainable": true}, "class_name": "Activation"}], "keras_version": "1.1.1", "class_name": "Sequential"}