{"keras_version": "1.1.1", "config": [{"config": [{"config": {"init": "glorot_uniform", "W_regularizer": null, "output_dim": 128, "b_constraint": null, "W_constraint": null, "b_regularizer": null, "activation": "relu", "bias": true, "input_dtype": "float32", "activity_regularizer": null, "batch_input_shape": [null, 150], "trainable": true, "input_dim": null, "name": "dense_1"}, "class_name": "Dense"}, {"config": {"trainable": true, "p": 0.25, "name": "dropout_1"}, "class_name": "Dropout"}, {"config": {"W_constraint": null, "trainable": true, "output_dim": 64, "b_regularizer": null, "b_constraint": null, "activation": "relu", "bias": true, "activity_regularizer": null, "init": "glorot_uniform", "W_regularizer": null, "input_dim": null, "name": "dense_2"}, "class_name": "Dense"}, {"config": {"trainable": true, "p": 0.25, "name": "dropout_2"}, "class_name": "Dropout"}, {"config": {"W_constraint": null, "trainable": true, "output_dim": 32, "b_regularizer": null, "b_constraint": null, "activation": "relu", "bias": true, "activity_regularizer": null, "init": "glorot_uniform", "W_regularizer": null, "input_dim": null, "name": "dense_3"}, "class_name": "Dense"}, {"config": {"trainable": true, "p": 0.25, "name": "dropout_3"}, "class_name": "Dropout"}, {"config": {"W_constraint": null, "trainable": true, "output_dim": 5, "b_regularizer": null, "b_constraint": null, "activation": "linear", "bias": true, "activity_regularizer": null, "init": "glorot_uniform", "W_regularizer": null, "input_dim": null, "name": "dense_4"}, "class_name": "Dense"}], "class_name": "Sequential"}, {"config": {"activation": "softmax", "trainable": true, "name": "activation_1"}, "class_name": "Activation"}], "class_name": "Sequential"}