{"class_name": "Sequential", "keras_version": "1.1.1", "config": [{"class_name": "Sequential", "config": [{"class_name": "Dense", "config": {"init": "glorot_uniform", "input_dtype": "float32", "output_dim": 512, "W_regularizer": null, "bias": true, "b_regularizer": null, "W_constraint": null, "activity_regularizer": null, "input_dim": null, "batch_input_shape": [null, 180], "trainable": true, "activation": "relu", "name": "dense_1", "b_constraint": null}}, {"class_name": "Dropout", "config": {"p": 0.25, "name": "dropout_1", "trainable": true}}, {"class_name": "Dense", "config": {"init": "glorot_uniform", "output_dim": 256, "W_regularizer": null, "bias": true, "b_regularizer": null, "activity_regularizer": null, "input_dim": null, "W_constraint": null, "trainable": true, "activation": "relu", "name": "dense_2", "b_constraint": null}}, {"class_name": "Dropout", "config": {"p": 0.1, "name": "dropout_2", "trainable": true}}, {"class_name": "Dense", "config": {"init": "glorot_uniform", "output_dim": 128, "W_regularizer": null, "bias": true, "b_regularizer": null, "activity_regularizer": null, "input_dim": null, "W_constraint": null, "trainable": true, "activation": "relu", "name": "dense_3", "b_constraint": null}}, {"class_name": "Dropout", "config": {"p": 0.1, "name": "dropout_3", "trainable": true}}, {"class_name": "Dense", "config": {"init": "glorot_uniform", "output_dim": 5, "W_regularizer": null, "bias": true, "b_regularizer": null, "activity_regularizer": null, "input_dim": null, "W_constraint": null, "trainable": true, "activation": "linear", "name": "dense_4", "b_constraint": null}}]}, {"class_name": "Activation", "config": {"activation": "softmax", "name": "activation_1", "trainable": true}}]}