class_name: Sequential
config:
- class_name: Sequential
  config:
  - class_name: Convolution2D
    config:
      W_constraint: null
      W_regularizer: null
      activation: relu
      activity_regularizer: null
      b_constraint: null
      b_regularizer: null
      batch_input_shape: !!python/tuple [null, 4, 5, 5]
      bias: true
      border_mode: valid
      dim_ordering: th
      init: glorot_uniform
      input_dtype: float32
      name: convolution2d_1
      nb_col: 2
      nb_filter: 128
      nb_row: 2
      subsample: &id001 !!python/tuple [1, 1]
      trainable: true
  - class_name: Dropout
    config: {name: dropout_1, p: 0.1, trainable: true}
  - class_name: Convolution2D
    config:
      W_constraint: null
      W_regularizer: null
      activation: relu
      activity_regularizer: null
      b_constraint: null
      b_regularizer: null
      bias: true
      border_mode: valid
      dim_ordering: th
      init: glorot_uniform
      name: convolution2d_2
      nb_col: 2
      nb_filter: 64
      nb_row: 2
      subsample: *id001
      trainable: true
  - class_name: Dropout
    config: {name: dropout_2, p: 0.1, trainable: true}
  - class_name: Convolution2D
    config:
      W_constraint: null
      W_regularizer: null
      activation: relu
      activity_regularizer: null
      b_constraint: null
      b_regularizer: null
      bias: true
      border_mode: valid
      dim_ordering: th
      init: glorot_uniform
      name: convolution2d_3
      nb_col: 2
      nb_filter: 32
      nb_row: 2
      subsample: *id001
      trainable: true
  - class_name: Dropout
    config: {name: dropout_3, p: 0.1, trainable: true}
  - class_name: Flatten
    config: {name: flatten_1, trainable: true}
  - class_name: Dense
    config: {W_constraint: null, W_regularizer: null, activation: relu, activity_regularizer: null,
      b_constraint: null, b_regularizer: null, bias: true, init: glorot_uniform, input_dim: null,
      name: dense_1, output_dim: 64, trainable: true}
  - class_name: Dropout
    config: {name: dropout_4, p: 0.1, trainable: true}
  - class_name: Dense
    config: {W_constraint: null, W_regularizer: null, activation: linear, activity_regularizer: null,
      b_constraint: null, b_regularizer: null, bias: true, init: glorot_uniform, input_dim: null,
      name: dense_2, output_dim: 5, trainable: true}
- class_name: Activation
  config: {activation: softmax, name: activation_1, trainable: true}
keras_version: 1.1.1
