class_name: Sequential
config:
- class_name: Dense
  config:
    W_constraint: null
    W_regularizer: null
    activation: relu
    activity_regularizer: null
    b_constraint: null
    b_regularizer: null
    batch_input_shape: !!python/tuple [null, 484]
    bias: true
    init: glorot_uniform
    input_dim: null
    input_dtype: float32
    name: dense_1
    output_dim: 512
    trainable: true
- class_name: Dropout
  config: {name: dropout_1, p: 0.25, trainable: true}
- class_name: Dense
  config: {W_constraint: null, W_regularizer: null, activation: relu, activity_regularizer: null,
    b_constraint: null, b_regularizer: null, bias: true, init: glorot_uniform, input_dim: null,
    name: dense_2, output_dim: 256, trainable: true}
- class_name: Dropout
  config: {name: dropout_2, p: 0.1, trainable: true}
- class_name: Dense
  config: {W_constraint: null, W_regularizer: null, activation: relu, activity_regularizer: null,
    b_constraint: null, b_regularizer: null, bias: true, init: glorot_uniform, input_dim: null,
    name: dense_3, output_dim: 128, trainable: true}
- class_name: Dropout
  config: {name: dropout_3, p: 0.1, trainable: true}
- class_name: Dense
  config: {W_constraint: null, W_regularizer: null, activation: linear, activity_regularizer: null,
    b_constraint: null, b_regularizer: null, bias: true, init: glorot_uniform, input_dim: null,
    name: dense_4, output_dim: 5, trainable: true}
keras_version: 1.1.1
