{"config": [{"config": [{"config": {"W_constraint": null, "input_dtype": "float32", "init": "glorot_uniform", "b_constraint": null, "input_dim": null, "bias": true, "activity_regularizer": null, "output_dim": 128, "b_regularizer": null, "activation": "relu", "batch_input_shape": [null, 150], "trainable": true, "name": "dense_1", "W_regularizer": null}, "class_name": "Dense"}, {"config": {"trainable": true, "name": "dropout_1", "p": 0.25}, "class_name": "Dropout"}, {"config": {"W_constraint": null, "init": "glorot_uniform", "b_constraint": null, "input_dim": null, "bias": true, "activity_regularizer": null, "output_dim": 64, "b_regularizer": null, "activation": "relu", "trainable": true, "name": "dense_2", "W_regularizer": null}, "class_name": "Dense"}, {"config": {"trainable": true, "name": "dropout_2", "p": 0.25}, "class_name": "Dropout"}, {"config": {"W_constraint": null, "init": "glorot_uniform", "b_constraint": null, "input_dim": null, "bias": true, "activity_regularizer": null, "output_dim": 32, "b_regularizer": null, "activation": "relu", "trainable": true, "name": "dense_3", "W_regularizer": null}, "class_name": "Dense"}, {"config": {"trainable": true, "name": "dropout_3", "p": 0.25}, "class_name": "Dropout"}, {"config": {"W_constraint": null, "init": "glorot_uniform", "b_constraint": null, "input_dim": null, "bias": true, "activity_regularizer": null, "output_dim": 5, "b_regularizer": null, "activation": "linear", "trainable": true, "name": "dense_4", "W_regularizer": null}, "class_name": "Dense"}], "class_name": "Sequential"}, {"config": {"trainable": true, "name": "activation_1", "activation": "softmax"}, "class_name": "Activation"}], "class_name": "Sequential", "keras_version": "1.1.1"}