{"config": [{"config": [{"config": {"b_regularizer": null, "b_constraint": null, "activation": "relu", "batch_input_shape": [null, 150], "init": "glorot_uniform", "activity_regularizer": null, "W_regularizer": null, "input_dim": null, "input_dtype": "float32", "trainable": true, "bias": true, "output_dim": 128, "name": "dense_1", "W_constraint": null}, "class_name": "Dense"}, {"config": {"name": "dropout_1", "trainable": true, "p": 0.25}, "class_name": "Dropout"}, {"config": {"b_regularizer": null, "b_constraint": null, "activation": "relu", "W_constraint": null, "init": "glorot_uniform", "activity_regularizer": null, "W_regularizer": null, "input_dim": null, "trainable": true, "bias": true, "output_dim": 64, "name": "dense_2"}, "class_name": "Dense"}, {"config": {"name": "dropout_2", "trainable": true, "p": 0.25}, "class_name": "Dropout"}, {"config": {"b_regularizer": null, "b_constraint": null, "activation": "relu", "W_constraint": null, "init": "glorot_uniform", "activity_regularizer": null, "W_regularizer": null, "input_dim": null, "trainable": true, "bias": true, "output_dim": 32, "name": "dense_3"}, "class_name": "Dense"}, {"config": {"name": "dropout_3", "trainable": true, "p": 0.25}, "class_name": "Dropout"}, {"config": {"b_regularizer": null, "b_constraint": null, "activation": "linear", "W_constraint": null, "init": "glorot_uniform", "activity_regularizer": null, "W_regularizer": null, "input_dim": null, "trainable": true, "bias": true, "output_dim": 5, "name": "dense_4"}, "class_name": "Dense"}], "class_name": "Sequential"}, {"config": {"name": "activation_1", "activation": "softmax", "trainable": true}, "class_name": "Activation"}], "class_name": "Sequential", "keras_version": "1.1.1"}